app/Models/Customer/Order_model.php

    public function is_order_exist($id)
    {
        helper('global_helper');
        $this->db = \Config\Database::connect();
        $this->user_id = get_current_user_id();
        $user_id = $this->user_id;

        return ($this->db->table('orders')->where(array('id' => $id, 'user_id' => $user_id))->countAllResults() > 0) ? TRUE : FALSE;
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `id` = '60'
AND `user_id` = '15'