app/Models/Admin/Customer_model.php

SELECT COUNT(*) AS `numrows`
FROM `auth_groups_users`
WHERE `group_id` = 2
---
    public function count_all_customers()
    {
        return $this->db->table('auth_groups_users')->where('group_id', 2)->countAllResults();

SELECT `g`.`group_id`, `g`.`user_id`, `u`.`name`, `u`.`phone_number`, `u`.`address`, `u`.`profile_picture`, `u`.`created_at`, `u`.`id`
FROM `auth_groups_users` `g`
LEFT JOIN `users` `u` ON `u`.`id` = `g`.`user_id`
WHERE `g`.`group_id` = 2
AND `u`.`active` = 1
ORDER BY `u`.`created_at` DESC
---
    public function latest_customers()
    {
        return $this->db->table('auth_groups_users g')
            ->select('g.group_id,g.user_id, u.name, u.phone_number, u.address, u.profile_picture,u.created_at,u.id')
            ->join('users u', 'u.id = g.user_id', 'left')
            ->where('g.group_id', 2)
            ->where('u.active', 1)
            ->orderBy('u.created_at', 'DESC')->get()->getResult();