app/Models/Admin/Product_model.php

    public function count_all_products()
    {
        $this->db = \Config\Database::connect();
        return $this->db->table('products')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `products`

    public function latest()
    {
        $this->db = \Config\Database::connect();
        return $this->db->table('products')->where('is_available', 1)->orderBy('add_date', 'DESC')->limit(5)->get()->getResult();
---
SELECT *
FROM `products`
WHERE `is_available` = 1
ORDER BY `add_date` DESC
 LIMIT 5

    public function latest_categories()
    {
        $this->db = \Config\Database::connect();
        return $this->db->table('product_category')->orderBy('id', 'DESC')->limit(5)->get()->getResult();
---
SELECT *
FROM `product_category`
ORDER BY `id` DESC
 LIMIT 5